Revit 2024 API
FamilyManager.RemoveParameter Method
Remove an existing family parameter from the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RemoveParameter(
	FamilyParameter familyParameter
)
Visual Basic
Public Sub RemoveParameter ( _
	familyParameter As FamilyParameter _
)
Visual C++
public:
void RemoveParameter(
	FamilyParameter^ familyParameter
)
Parameters
familyParameter
Type: Autodesk.Revit.DB.FamilyParameter
The family parameter.
Remarks
Only family and shared parameters may be removed, built-in parameters may not be removed. If the parameter is used in any formulas, those formulas will be automatically removed along with the parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the family parameter deletion failed.
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace